In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('data/salaries.csv')
df

                Name  Country Salary_Currency  Monthly_Salary Date_Of_Payment
0      Ronald Mathis  Germany             EUR        14533.28      2015-03-02
1      Ronald Mathis  Germany             EUR        14361.20      2015-04-01
2      Ronald Mathis  Germany             EUR        14191.17      2015-05-01
3      Ronald Mathis  Germany             EUR        14023.14      2015-05-31
4      Ronald Mathis  Germany             EUR        13857.11      2015-06-30
..               ...      ...             ...             ...             ...
427  Kristen Trevino   Poland             PLN         1245.16      2017-09-17
428  Kristen Trevino   Poland             PLN         1154.48      2017-10-17
429  Kristen Trevino   Poland             PLN         1070.41      2017-11-16
430  Kristen Trevino   Poland             PLN          992.46      2017-12-16
431  Kristen Trevino   Poland             PLN          920.19      2018-01-15

[432 rows x 5 columns]